#+title: Elden Ring Walkthrough
#+author: KRV Perera
#+email: rukshan.viduranga@gmail.com

* Navigation
:PROPERTIES:
:CUSTOM_ID: TOP
:END:

[[file:krvperera.org][Home]] [[file:office.org][OFFICE]] [[file:linux.org][LINUX]] [[file:country.org][Country]] [[file:org-mode-reference-in.org][HotKeys]] [[file:Professional.org][Professional]] [[#BOTTOM][BOTTOM]]

* Items I need to farming

** Exalted Flesh

| Item            | place                                                  | count |
|-----------------+--------------------------------------------------------+-------|
| Rowa fruit      |                                                        |     5 |
| Lump of flesh   | Animals kills, Bell bearing at night in Church of vows |     1 |
| Hefty Best bone |                                                        |     1 |
| Arteria leaf    |                                                        |     1 |


* My Current Build

| Stat         | value | FightinCowboy |
|--------------+-------+---------------|
| Vigor        |    31 |            33 |
| Mind         |    17 |            10 |
| Endurance    |    18 |            20 |
| Strength     |    22 |            18 |
| Dexterity    |    22 |            18 |
| Intelligence |    12 |             9 |
| Faith        |    20 |             9 |
| Arcane       |    13 |             7 |
|--------------+-------+---------------|
| Total        |   155 |           124 |
#+TBLFM: @>$2=vsum(@I..@II)
#+TBLFM: @>$3=vsum(@I..@II)

* Builds

** Stats caps

| Stat         | cap1 |   cap2 | cap3 |
|--------------+------+--------+------|
| Vigor        |   40 |        |   60 |
| Mind         |      |     55 |   60 |
| Endurance    |      |     50 |      |
| Strength     |   20 |     55 |   80 |
| Dexterity    |   20 |     55 |   80 |
| Intelligence |   20 | 50, 60 |   80 |
| Faith        |   20 | 50, 60 |   80 |
| Arcane       |   20 | 50, 60 |   80 |
|--------------+------+--------+------|
| Total        |  140 |        |  520 |
#+TBLFM: @>$2=vsum(@I..@II)
#+TBLFM: @>$4=vsum(@I..@II)

** Immortal Paladin [[https://www.youtube.com/watch?v=Z9BDkcTpHNE&t=123s][Link]]


| Stat         | value |
|--------------+-------|
| Vigor        |    40 |
| Mind         |    20 |
| Endurance    |    30 |
| Strength     |    65 |
| Dexterity    |    17 |
| Intelligence |    13 |
| Faith        |    31 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   229 |
#+TBLFM: @>$2=vsum(@I..@II)

Clawmark seal
Shard of Alexander
Sacred Scoprion Charm
Erdtree's Flavour +2
Radagon source seal

Dragoncrest GreatShield Talisman - Enormously Boosts physical damage

| Item                                | Effect           | Value | Level |   |
|-------------------------------------+------------------+-------+-------+---|
| Iron Great, Inseparable great sword | Blade Dance      |       |    25 |   |
| Banished Knight Great Sword         | Blade Dance      |       |    25 |   |
| Heavy Greate Stars                  | Prayerful Strike |       |    25 |   |
|-------------------------------------+------------------+-------+-------+---|

Shard of Alexander - Greatly boosts the attack power of skills


** Wall of frenzy [[https://youtu.be/prB2e-yKGD4?t=729][Link]]


| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    21 |
| Endurance    |    44 |
| Strength     |    48 |
| Dexterity    |    20 |
| Intelligence |     9 |
| Faith        |    18 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   229 |
#+TBLFM: @>$2=vsum(@I..@II)

Fingerprint Armor - poise

| Item                           | Effect             | Value | Level |   |
|--------------------------------+--------------------+-------+-------+---|
| Heavy fingerprint Stone Shield | Shield Bash        |       |    25 |   |
| Vyke's Was Spear               | Frenzyflame Thrust |       |    10 |   |
|--------------------------------+--------------------+-------+-------+---|

Shard of Alexander - Greatly boosts the attack power of skills




** Spellsword Build - The Exiled Mage [[https://www.youtube.com/watch?v=BLTmyVRAMrw&list=PL7RtZMiaOk8gF9ezBWxRgN6awSM91rAeT&index=13][Link]]

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    22 |
| Endurance    |    30 |
| Strength     |    30 |
| Dexterity    |    18 |
| Intelligence |    50 |
| Faith        |    14 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   233 |
#+TBLFM: @>$2=vsum(@I..@II)

| Item                      | Effect             | Value | Level |                 |
|---------------------------+--------------------+-------+-------+-----------------|
| Magic Nightrider Glaive   | Attack Power       |   727 |    25 | Sword Dance     |
| Lordsworns Straight Sword | Attack Power       |   517 |    25 | Hearfrost Stomp |
| Erdtree Great Shield      | Golden Retaliation |   517 |    10 |                 |
| Academy Glintstone Staff  | Sorcery Scaling    |   269 |    25 |                 |
| Loretta's War Sickle      |                    |       |    10 |                 |
|---------------------------+--------------------+-------+-------+-----------------|

Erdtree Favour, Marika's Soreseal, Radagon Icon, Graven-Mass Talisman

** Quality

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    13 |
| Endurance    |    34 |
| Strength     |    55 |
| Dexterity    |    55 |
| Intelligence |     9 |
| Faith        |    14 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   249 |
#+TBLFM: @>$2=vsum(@I..@II)

** Faith Build - Golden God [[https://www.youtube.com/watch?v=DFRYbiwYajE&list=PL7RtZMiaOk8gF9ezBWxRgN6awSM91rAeT&index=9][Link]]

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    25 |
| Endurance    |    25 |
| Strength     |    17 |
| Dexterity    |    25 |
| Intelligence |     9 |
| Faith        |    80 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   250 |
#+TBLFM: @>$2=vsum(@I..@II)

** Hybrid Caster Build - The Pursuer

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    41 |
| Endurance    |    10 |
| Strength     |    12 |
| Dexterity    |    12 |
| Intelligence |    50 |
| Faith        |    50 |
| Arcane       |    14 |
|--------------+-------|
| Total        |   249 |
#+TBLFM: @>$2=vsum(@I..@II)

| Item                     | Effect              | Value | Level |
|--------------------------+---------------------+-------+-------|
| Sword of Night and Flame | Attack Power        |   701 |    10 |
| Golden Order seal        | Incantation Scaling |   345 |    10 |
| Prince of Deaths Staff   | Sorcery Scaling     |   286 |    25 |
|--------------------------+---------------------+-------+-------|

Erdtree Favour, Marika's Soreseal, Radagon Icon, Graven-Mass Talisman

* Main ideas

** Assasin
*** Golden parry
This is royal capital need to wait some time
**** Buckler parry
**** Best small shield
Iron Roundshield

*** Good bow
*** Good Crit Damage
*** Stance break
*** Poise Armor
*** Assassin's Cerulean Dagger - Black Knife Catacombs - NE Liurnia Of the Lakes

* Walk Through
** FightinCowboy
:PROPERTIES:
:CUSTOM_ID: FIGHTINCOWBOY
:END:
*** TODO [[https://www.youtube.com/watch?v=p4uxeniQsg4&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=11][Stormveil Castle]]
**** TODO Defeat the Crucible Knight

*** DONE PART 12 - [[https://www.youtube.com/watch?v=EQzBxb_ZQWQ&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=12][Godrick the Grafted]]
CLOSED: [2022-05-19 බ්‍ර 15:15]
**** DONE Seed beast - door is open from Rampart tower
CLOSED: [2022-05-19 බ්‍ර 15:15]

*** TODO Abandoned Cave [[https://www.youtube.com/watch?v=orecZ59sHj8&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=30][Link]]
    45, 15, 32, 35, 26, 14, 14, 12

* Assasin Stealth
[[https://www.youtube.com/watch?v=xCKi6g-Fm_E][Assasing Stealth]]
[[https://www.youtube.com/watch?v=DxCpnGtO1ns][ELDEN RING - The Best CRITICAL HIT VAMPIRIC BUILD for EVERYTHING: PARRY, STANCE BREAK & BACKSTABS]]


* Weapons

Item Discovery - Smoldering Church west of starting og Caleid

Bandits Curved Sword - farming - Church of Pilgrimage

* Crafting Items
[[https://www.youtube.com/watch?v=QjxsxIefaAI][5 secret items]]
    Gravity stone chunks
    Exalted Flesh - increase damage


* Channels
:PROPERTIES:
:CUSTOM_ID: CHANNELS
:END:
** [[https://www.youtube.com/watch?v=iSjviLX1x1g][KhrazeGaming]]




[[#TOP][TOP]]

* Bottom Navigation
:PROPERTIES:
:CUSTOM_ID: BOTTOM
:END:
